export const BASE_URL = 'https://www.kopis.or.kr';

export const RECENT_KEYWORD_STORAGE_KEY = '@recent_searches';
export const RECENT_KEYWORD_MAX_COUNT = 100;

export const holidayList: string[] = [
  '20260101', // 신정
  '20260216',
  '20260217',
  '20260218', // 설날 연휴
  '20260301',
  '20260302', // 삼일절 + 대체공휴일
  '20260505', // 어린이날
  '20260524',
  '20260525', // 부처님오신날 + 대체공휴일
  '20260606',
  '20260608', // 현충일 + 대체공휴일
  '20260815',
  '20260817', // 광복절 + 대체공휴일
  '20260930',
  '20261001',
  '20261002', // 추석 연휴
  '20261003',
  '20261005', // 개천절 + 대체공휴일
  '20261009', // 한글날
  '20261225', // 크리스마스
];
